ehcouto/DEA801_ARMotion/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_IBE_ibe0 0x00u          /*!<@brief Input Buffer Enable: Disables */
#define PCR_IBE_ibe1 0x01u          /*!<@brief Input Buffer Enable: Enables */
#define PORT0_PCR0_MUX_mux01 0x01u  /*!<@brief Pin Multiplex Control: Alternative 1 (chip-specific) */
#define PORT0_PCR1_MUX_mux01 0x01u  /*!<@brief Pin Multiplex Control: Alternative 1 (chip-specific) */
#define PORT2_PCR17_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR19_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR2_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR5_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR6_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*! @name PORT2_1 (number 15), OPAMP2_INN_CURR_W
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_ADC1_A0_CURR_W_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_ADC1_A0_CURR_W_PIN 1U                   /*!<@brief PORT pin number */
#define PIN_ADC1_A0_CURR_W_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT2_1 (number 15), OPAMP2_INN_CURR_W
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_OPAMP2_INN_CURR_W_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_OPAMP2_INN_CURR_W_PIN 1U                   /*!<@brief PORT pin number */
#define PIN_OPAMP2_INN_CURR_W_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT2_2 (number 16), DAC_OUT
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_DAC_OUT_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_DAC_OUT_PIN 2U                   /*!<@brief PORT pin number */
#define PIN_DAC_OUT_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORT2_7 (number 21), ADC_VREF_IN
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_ADC0_VREF_IN_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_ADC0_VREF_IN_PIN 7U                   /*!<@brief PORT pin number */
#define PIN_ADC0_VREF_IN_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORT2_7 (number 21), ADC_VREF_IN
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_ADC2_VREF_IN_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_ADC2_VREF_IN_PIN 7U                   /*!<@brief PORT pin number */
#define PIN_ADC2_VREF_IN_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORT2_7 (number 21), ADC_VREF_IN
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_ADC3_VREF_IN_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_ADC3_VREF_IN_PIN 7U                   /*!<@brief PORT pin number */
#define PIN_ADC3_VREF_IN_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORT2_7 (number 21), ADC_VREF_IN
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_ADC1_VREF_IN_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_ADC1_VREF_IN_PIN 7U                   /*!<@brief PORT pin number */
#define PIN_ADC1_VREF_IN_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORT2_7 (number 21), ADC_VREF_IN
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_CMP0_VREF_IN_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_CMP0_VREF_IN_PIN 7U                   /*!<@brief PORT pin number */
#define PIN_CMP0_VREF_IN_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORT2_7 (number 21), ADC_VREF_IN
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_CMP1_VREF_IN_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_CMP1_VREF_IN_PIN 7U                   /*!<@brief PORT pin number */
#define PIN_CMP1_VREF_IN_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORT2_7 (number 21), ADC_VREF_IN
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_ADC2_A7_VREF_IN_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_ADC2_A7_VREF_IN_PIN 7U                   /*!<@brief PORT pin number */
#define PIN_ADC2_A7_VREF_IN_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT2_7 (number 21), ADC_VREF_IN
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_ADC3_A7_VREF_IN_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_ADC3_A7_VREF_IN_PIN 7U                   /*!<@brief PORT pin number */
#define PIN_ADC3_A7_VREF_IN_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT2_7 (number 21), ADC_VREF_IN
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_ADC0_A7_VREF_IN_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_ADC0_A7_VREF_IN_PIN 7U                   /*!<@brief PORT pin number */
#define PIN_ADC0_A7_VREF_IN_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT2_7 (number 21), ADC_VREF_IN
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_ADC1_A7_VREF_IN_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_ADC1_A7_VREF_IN_PIN 7U                   /*!<@brief PORT pin number */
#define PIN_ADC1_A7_VREF_IN_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT2_13 (number 23), OPAMP0_CURR_U_N
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_OPAMP0_CURR_U_N_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define PIN_OPAMP0_CURR_U_N_PIN 13U                   /*!<@brief PORT pin number */
#define PIN_OPAMP0_CURR_U_N_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT2_16 (number 25), OPAMP1_INP_GNDV
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_OPAMP1_INP_GNDV_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define PIN_OPAMP1_INP_GNDV_PIN 16U                   /*!<@brief PORT pin number */
#define PIN_OPAMP1_INP_GNDV_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                      /* @} */

