ehcouto/DEA801_ARMotion/board/pin_mux.h
/*! @name PORT3_31 (number 30), ADC1_IPMTEMP
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_ADC1_A20_IPMTEMP_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define PIN_ADC1_A20_IPMTEMP_PIN 31U                   /*!<@brief PORT pin number */
#define PIN_ADC1_A20_IPMTEMP_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT3_31 (number 30), ADC1_IPMTEMP
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_ADC1_A28_IPMTEMP_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define PIN_ADC1_A28_IPMTEMP_PIN 31U                   /*!<@brief PORT pin number */
#define PIN_ADC1_A28_IPMTEMP_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT3_30 (number 31), PUMP_SET
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_PUMP_SET_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define PIN_PUMP_SET_GPIO_PIN 30U              /*!<@brief GPIO pin number */
#define PIN_PUMP_SET_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PIN_PUMP_SET_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define PIN_PUMP_SET_PIN 30U                   /*!<@brief PORT pin number */
#define PIN_PUMP_SET_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORT3_28 (number 33), GEN_UART4_RX
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_GEN_UART4_RX_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define PIN_GEN_UART4_RX_PIN 28U                   /*!<@brief PORT pin number */
#define PIN_GEN_UART4_RX_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORT3_27 (number 34), GEN_UART4_TX
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_GEN_UART4_TX_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define PIN_GEN_UART4_TX_PIN 27U                   /*!<@brief PORT pin number */
#define PIN_GEN_UART4_TX_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORT3_14 (number 36), PILOT_EV_H2O
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_PILOT_EV_H2O_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define PIN_PILOT_EV_H2O_GPIO_PIN 14U              /*!<@brief GPIO pin number */
#define PIN_PILOT_EV_H2O_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PIN_PILOT_EV_H2O_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define PIN_PILOT_EV_H2O_PIN 14U                   /*!<@brief PORT pin number */
#define PIN_PILOT_EV_H2O_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORT3_13 (number 37), PILOT_EV_DISP
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_PILOT_EV_DISP_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define PIN_PILOT_EV_DISP_GPIO_PIN 13U              /*!<@brief GPIO pin number */
#define PIN_PILOT_EV_DISP_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PIN_PILOT_EV_DISP_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define PIN_PILOT_EV_DISP_PIN 13U                   /*!<@brief PORT pin number */
#define PIN_PILOT_EV_DISP_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT3_12 (number 38), PILOT_EV_REGEN
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_PILOT_EV_REGEN_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define PIN_PILOT_EV_REGEN_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define PIN_PILOT_EV_REGEN_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PIN_PILOT_EV_REGEN_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define PIN_PILOT_EV_REGEN_PIN 12U                   /*!<@brief PORT pin number */
#define PIN_PILOT_EV_REGEN_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT3_9 (number 41), PWM_V_L
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_PWM_V_L_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define PIN_PWM_V_L_PIN 9U                   /*!<@brief PORT pin number */
#define PIN_PWM_V_L_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORT3_8 (number 42), PWM_V_H
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_PWM_V_H_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define PIN_PWM_V_H_PIN 8U                   /*!<@brief PORT pin number */
#define PIN_PWM_V_H_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORT3_1 (number 45), PMW_U_L
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_PMW_U_L_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define PIN_PMW_U_L_PIN 1U                   /*!<@brief PORT pin number */
#define PIN_PMW_U_L_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORT3_0 (number 46), PMW_U_H
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_PMW_U_H_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define PIN_PMW_U_H_PIN 0U                   /*!<@brief PORT pin number */
#define PIN_PMW_U_H_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORT0_1 (number 50), TCK_SWCLK
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_TCK_SWCLK_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define PIN_TCK_SWCLK_PIN 1U                   /*!<@brief PORT pin number */
#define PIN_TCK_SWCLK_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORT1_2 (number 58), ADC0_A18_VBUS_DC_2
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_ADC0_A18_VBUS_DC_2_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define PIN_ADC0_A18_VBUS_DC_2_PIN 2U                   /*!<@brief PORT pin number */
#define PIN_ADC0_A18_VBUS_DC_2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT1_2 (number 58), ADC0_A18_VBUS_DC_2
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_CMP2_IN3N_VBUS_DC_2_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define PIN_CMP2_IN3N_VBUS_DC_2_PIN 2U                   /*!<@brief PORT pin number */
#define PIN_CMP2_IN3N_VBUS_DC_2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT1_2 (number 58), ADC0_A18_VBUS_DC_2
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_CMP2_IN3P_VBUS_DC_2_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define PIN_CMP2_IN3P_VBUS_DC_2_PIN 2U                   /*!<@brief PORT pin number */
#define PIN_CMP2_IN3P_VBUS_DC_2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT1_3 (number 59), ADC0_A18_VBUS_DC_1
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_ADC0_A18_VBUS_DC_1_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define PIN_ADC0_A18_VBUS_DC_1_PIN 3U                   /*!<@brief PORT pin number */
#define PIN_ADC0_A18_VBUS_DC_1_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT1_3 (number 59), ADC0_A18_VBUS_DC_1
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_CMP0_IN1P_VBUS_DC_1_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define PIN_CMP0_IN1P_VBUS_DC_1_PIN 3U                   /*!<@brief PORT pin number */
#define PIN_CMP0_IN1P_VBUS_DC_1_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT1_3 (number 59), ADC0_A18_VBUS_DC_1
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_CMP0_IN1N_VBUS_DC_1_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define PIN_CMP0_IN1N_VBUS_DC_1_PIN 3U                   /*!<@brief PORT pin number */
#define PIN_CMP0_IN1N_VBUS_DC_1_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                         /* @} */

