ehcouto/DEA801_ARMotion/board/pin_mux.h
/*! @name PORT0_0 (number 49), TMS_SWDIO
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_TMS_SWDIO_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define PIN_TMS_SWDIO_PIN 0U                   /*!<@brief PORT pin number */
#define PIN_TMS_SWDIO_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORT0_2 (number 51), TDO_SWO
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_TDO_SWO_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define PIN_TDO_SWO_PIN 2U                   /*!<@brief PORT pin number */
#define PIN_TDO_SWO_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORT1_31 (number 10), OPT_XTAL_IN2
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_OPT_XTAL_IN2_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define PIN_OPT_XTAL_IN2_PIN 31U                   /*!<@brief PORT pin number */
#define PIN_OPT_XTAL_IN2_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORT2_3 (number 17), IN_12V_DS
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_IN_12V_DS_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define PIN_IN_12V_DS_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define PIN_IN_12V_DS_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PIN_IN_12V_DS_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_IN_12V_DS_PIN 3U                   /*!<@brief PORT pin number */
#define PIN_IN_12V_DS_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORT1_0 (number 56), PILOT_GND_SWITCH_REL
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_PILOT_GND_SWITCH_REL_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define PIN_PILOT_GND_SWITCH_REL_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define PIN_PILOT_GND_SWITCH_REL_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PIN_PILOT_GND_SWITCH_REL_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define PIN_PILOT_GND_SWITCH_REL_PIN 0U                   /*!<@brief PORT pin number */
#define PIN_PILOT_GND_SWITCH_REL_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT3_11 (number 39), PWM_W_L
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_PWM_W_L_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define PIN_PWM_W_L_PIN 11U                   /*!<@brief PORT pin number */
#define PIN_PWM_W_L_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORT3_10 (number 40), PWM_W_H
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_PWM_W_H_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define PIN_PWM_W_H_PIN 10U                   /*!<@brief PORT pin number */
#define PIN_PWM_W_H_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORT2_12 (number 22), OPAMP0_INP_GNDU
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_OPAMP0_INP_GNDU_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define PIN_OPAMP0_INP_GNDU_PIN 12U                   /*!<@brief PORT pin number */
#define PIN_OPAMP0_INP_GNDU_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT0_16 (number 54), ZC_IN
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_ZC_IN_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define PIN_ZC_IN_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define PIN_ZC_IN_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PIN_ZC_IN_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define PIN_ZC_IN_PIN 16U                   /*!<@brief PORT pin number */
#define PIN_ZC_IN_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORT0_17 (number 55), PILOT_GND_REL_HEAT
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_PILOT_GND_REL_HEAT_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define PIN_PILOT_GND_REL_HEAT_GPIO_PIN 17U              /*!<@brief GPIO pin number */
#define PIN_PILOT_GND_REL_HEAT_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PIN_PILOT_GND_REL_HEAT_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define PIN_PILOT_GND_REL_HEAT_PIN 17U                   /*!<@brief PORT pin number */
#define PIN_PILOT_GND_REL_HEAT_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT2_19 (number 27), OPAMP1_OUT_CURR_V
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_OPAMP1_OUT_CURR_V_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define PIN_OPAMP1_OUT_CURR_V_PIN 19U                   /*!<@brief PORT pin number */
#define PIN_OPAMP1_OUT_CURR_V_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT2_15 (number 24), OPAMP0_OUT_CURR_U
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_OPAMP0_OUT_CURR_U_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define PIN_OPAMP0_OUT_CURR_U_PIN 15U                   /*!<@brief PORT pin number */
#define PIN_OPAMP0_OUT_CURR_U_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                        /* @} */

