ehcouto/DEA801_ARMotion/board/pin_mux.h
/*! @name PORT2_17 (number 26), OPAMP1_INN_CURR_V
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_OPAMP1_INN_CURR_V_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define PIN_OPAMP1_INN_CURR_V_PIN 17U                   /*!<@brief PORT pin number */
#define PIN_OPAMP1_INN_CURR_V_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT2_0 (number 14), OPAMP2_INP_GNDW
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_OPAMP2_INP_GNDW_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_OPAMP2_INP_GNDW_PIN 0U                   /*!<@brief PORT pin number */
#define PIN_OPAMP2_INP_GNDW_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT2_0 (number 14), OPAMP2_INP_GNDW
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_ADC0_A0_GNDW_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_ADC0_A0_GNDW_PIN 0U                   /*!<@brief PORT pin number */
#define PIN_ADC0_A0_GNDW_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORT2_6 (number 20), OPAMP2_OUT_CURR_W
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_OPAMP2_OUT_CURR_W_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_OPAMP2_OUT_CURR_W_PIN 6U                   /*!<@brief PORT pin number */
#define PIN_OPAMP2_OUT_CURR_W_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT2_6 (number 20), OPAMP2_OUT_CURR_W
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_ADC2_A2_CURR_W_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_ADC2_A2_CURR_W_PIN 6U                   /*!<@brief PORT pin number */
#define PIN_ADC2_A2_CURR_W_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT2_6 (number 20), OPAMP2_OUT_CURR_W
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_ADC1_A3_CURR_W_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_ADC1_A3_CURR_W_PIN 6U                   /*!<@brief PORT pin number */
#define PIN_ADC1_A3_CURR_W_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT1_30 (number 9), OPT_XTAL_IN1
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_OPT_XTAL_IN1_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define PIN_OPT_XTAL_IN1_PIN 30U                   /*!<@brief PORT pin number */
#define PIN_OPT_XTAL_IN1_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORT2_5 (number 19), PILOT_FAIL_TST_BULK
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_PILOT_FAIL_TST_BULK_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define PIN_PILOT_FAIL_TST_BULK_GPIO_PIN 5U              /*!<@brief GPIO pin number */
#define PIN_PILOT_FAIL_TST_BULK_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PIN_PILOT_FAIL_TST_BULK_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_PILOT_FAIL_TST_BULK_PIN 5U                   /*!<@brief PORT pin number */
#define PIN_PILOT_FAIL_TST_BULK_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT1_11 (number 5), FB_DIVER
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_FB_DIVER_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define PIN_FB_DIVER_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define PIN_FB_DIVER_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PIN_FB_DIVER_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define PIN_FB_DIVER_PIN 7U                   /*!<@brief PORT pin number */
#define PIN_FB_DIVER_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name RESET_B (number 8), RESET
  @{ */
/* @} */

/*! @name PORT1_9 (number 3), FB_HEATER
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_FB_HEATER_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define PIN_FB_HEATER_GPIO_PIN 10U              /*!<@brief GPIO pin number */
#define PIN_FB_HEATER_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PIN_FB_HEATER_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define PIN_FB_HEATER_PIN 10U                   /*!<@brief PORT pin number */
#define PIN_FB_HEATER_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORT2_2 (number 16), DAC_OUT
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_DAC_OUT_CMP0N_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_DAC_OUT_CMP0N_PIN 2U                   /*!<@brief PORT pin number */
#define PIN_DAC_OUT_CMP0N_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORT2_2 (number 16), DAC_OUT
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_DAC_OUT_CMP0P_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_DAC_OUT_CMP0P_PIN 2U                   /*!<@brief PORT pin number */
#define PIN_DAC_OUT_CMP0P_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORT2_2 (number 16), DAC_OUT
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_DAC_OUT_ADC0A4_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define PIN_DAC_OUT_ADC0A4_PIN 2U                   /*!<@brief PORT pin number */
#define PIN_DAC_OUT_ADC0A4_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT3_15 (number 35), PILOT_DIVER
  @{ */

