ehcouto/DEA801_ARMotion/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define PIN_PILOT_DIVER_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define PIN_PILOT_DIVER_GPIO_PIN 15U              /*!<@brief GPIO pin number */
#define PIN_PILOT_DIVER_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PIN_PILOT_DIVER_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define PIN_PILOT_DIVER_PIN 15U                   /*!<@brief PORT pin number */
#define PIN_PILOT_DIVER_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORT3_7 (number 43), PILOT_SYN_MOTOR
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_PILOT_SYN_MOTOR_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define PIN_PILOT_SYN_MOTOR_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define PIN_PILOT_SYN_MOTOR_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PIN_PILOT_SYN_MOTOR_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define PIN_PILOT_SYN_MOTOR_PIN 7U                   /*!<@brief PORT pin number */
#define PIN_PILOT_SYN_MOTOR_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT0_3 (number 52), TDI
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_TDI_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define PIN_TDI_PIN 3U                   /*!<@brief PORT pin number */
#define PIN_TDI_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORT0_6 (number 53), MEAS_3V3
  @{ */

/* Symbols to be used with PORT driver */
#define PIN_MEAS_3V3_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define PIN_MEAS_3V3_PIN 6U                   /*!<@brief PORT pin number */
#define PIN_MEAS_3V3_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
